class RoadFeature {
  static apply(world) {
    // 1) Получение поинта откуда дорога идет (нужно хранить)
    // 2) Получение поинта куда дорога идет
    // 3) Генерация типа поинта (end/front/fork)
    // Сохранение новых путей если таковые имеются

    /**
     * point: {                          | создать новые поинты => так до определенного кол-ва раз (или пока игроки не перестанут видеть)
     *  tilePos: [0,0],                  | установить тайлы
     *  type: "end"/"front"/"fork",   => | раскидать энтити (столбы, машины, враги)
     * }                                 | READY
     */                                  
  }
}